tsung/Load_Test_1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="luber-michael.j2zayzetn4.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

<!--Scenario: Log in / Post car / make rental for it / signout-->

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
       <http url="/login" method="POST" version="1.1">
         <www_authenticate userid="Michael" passwd="123456" type="digest" />
        <dyn_variable name="nonce" header="www-authenticate/nonce"/>
        <dyn_variable name="realm" header="www-authenticate/realm"/>
        <http url="/signin" method="GET" version="1.1"/>
      </request>

      <request subst="true">
       <dyn_variable name="nonce" header="authentication-info/nextnonce"/>
       <http url="/signin" method="GET" version="1.1">
         <www_authenticate userid="a@a.com" passwd="123456" type="digest" realm="%%_realm%%" nonce="%%_nonce%%"/>

       </http>
     </request>

    </session>
  </sessions>
</tsung>