tsung/Load_Test_1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="0.0.0.0" port="3000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

<!--Scenario: Log in / Post car / make rental for it / signout-->

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
        <transaction name="post_car_rental">
          <request>
            <http url="/signin" method="POST" version="1.1" contents="session[email]=as@as.com&amp;session[password]=123456&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
          </request>

          <request>
            <http url="/cars" method="POST" version="1.1" contents="car[make]=Ford&amp;car[model]=Mustang&amp;car[year]=2017&amp;car[color]=Red&amp;car[license_plate]=1234567&amp;car[all_tags]=trendy&amp;commit=Add+Car"/>
          </request>

          <request>
            <http url="/rentals" method="POST" version="1.1" contents="rental[car_id]=12&amp;rental[start_location]=Santa+Barbara&amp;rental[end_location]=Sunnyvale&amp;rental[start_time(2i)]=11&amp;rental[start_time(3i)]=30&amp;rental[start_time(1i)]=2017&amp;rental[start_time(4i)]=05&amp;rental[start_time(5i)]=00&amp;rental[end_time(2i)]=11&amp;rental[end_time(3i)]=30&amp;rental[end_time(1i)]=2017&amp;rental[end_time(4i)]=05&amp;rental[end_time(5i)]=00&amp;rental[price]=123.45&amp;commit=Create+Rental+Post"/>
          </request>

          <request>
            <http url="/signout" method="DELETE" version="1.1" />
          </request>

        </transaction>
    </session>
  </sessions>
</tsung>